app/controllers/messages_controller.rb

INSERT INTO "messages" ("created_at", "endtime", "longmessage", "shortmessage", "starttime", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @message = Message.new(message_params)

    respond_to do |format|
      if @message.save