app/controllers/mybutts_controller.rb

SELECT "mybutts".* FROM "mybutts"
---
  def index
    @mybutts = Mybutt.all

INSERT INTO "mybutts" ("created_at", "cturl", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2016-01-27 03:24:57.368169"], ["cturl", "https://youtu.be/sJZsgDXEbQc"], ["name", "video1"], ["updated_at", "2016-01-27 03:24:57.368169"]]
---
  def create
    @mybutt = Mybutt.new(mybutt_params)

    respond_to do |format|
      if @mybutt.save

UPDATE "mybutts" SET "cturl" = ?, "updated_at" = ? WHERE "mybutts"."id" = 1  [["cturl", "https://www.youtube.com/embed/sJZsgDXEbQc"], ["updated_at", "2016-01-27 04:14:23.165803"]]
---
  def update
    respond_to do |format|
      if @mybutt.update(mybutt_params)

SELECT  "mybutts".* FROM "mybutts"  WHERE "mybutts"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_mybutt
      @mybutt = Mybutt.find(params[:id])